import asyncio #Подключение библиотеки для поддерживание ассинххронности работы бота
from aiogram import Bot, Dispatcher, types, F #подключение основных классов библиотеки aiogram для выполнения ключевых функций бота
from aiogram.filters import CommandStart #подключение класса для реализации команды /start
from aiogram.enums import ParseMode #Подключение класса для форматирования текста

#Подключение классов для реализации клавиатуры
from aiogram.utils.keyboard import ReplyKeyboardBuilder
from aiogram.types import KeyboardButton, ReplyKeyboardRemove, BotCommand, BotCommandScopeAllPrivateChats

#инициализация бота с токеном в телеграме
bot = Bot(token='7102924645:AAETKCNJWoPP1e2uaBzjacCB4L1JJDi2lgo', parse_mode=ParseMode.HTML)

#инициализация объекта класса Dispatcher
dp = Dispatcher()

#список улавливаемых ботом апдейтов
ALLOWED_UPDATES = ['messages, edited_messages']

#объявление стартовой клавиатуры для обеспечения понятной работы пользователя с ботом и использования его функционала
start_kb = ReplyKeyboardBuilder()
#добавление кнопок в клавитатуру
start_kb.add(
    KeyboardButton(text = '✅Перевести с русской раскладки на англйискую✅'),
    KeyboardButton(text = '✅Перевести с английской раскладки на русскую✅'),
    KeyboardButton(text = '✅Перевести текст в нижний регистр✅'),
)
#распределение кнопок по клавиатуре, чтобы в первом ряду клавиатуры было две кнопки, а во втором - одна
start_kb.adjust(2, 1)

# Функция для сохранения реплики пользователя в файл
def save_user_reply(user_reply):
    with open("user_replies.txt", "a", encoding="utf-8") as file:
        file.write(user_reply)

#хэндлер, отлавливающий команду старт
@dp.message(CommandStart())
#функция, осуществляющая знакомство пользователя с ботом
async def start_cmd(message: types.Message):
    await message.answer('Привет! Этот бот создан в рамках проекта по дисциплине <i>"Программирование"</i>.\n'
                         'Представьте ситуацию, в которой вы написали большущий текст, и лишь опосля поняли, '
                         'что все это время писали, например, не на русской раскладке, а на английской.🤔\n'
                         'Похоже, придется все <b>переписывать</b>😢.\n'
                         'Но, воспользовавшись <b>этим ботом</b>, вы сможете не только исправить раскладку написанного текста с <b>английской на русскую</b> и наоборот,'
                         'но еще и исправить аналогичную ситуацию с <b>верхним регистром</b>.\n'
                         'Для этого просто воспользуйтесь <b>клавиатурой</b> и выберите действие, которое вам необходимо!✅',
                         reply_markup=start_kb.as_markup( #после отправки ботом вышеописанного сообщения, появится клавиатура для дальнейшей работы пользователя с ботом
                             resize_keyboard=True,
                             input_field_placeholder='Что вас интересует?'
                         ))

#функция, осуществляеюшая перевод текста из английской раскладки на русскую
def to_ru(text):
    #словарь, опираясь на который, происходит перевод текста с английской раскладки на русскую
    translit_dict = {
        'q': 'й', 'w': 'ц', 'e': 'у', 'r': 'к', 't': 'е', 'y': 'н', 'u': 'г', 'i': 'ш', 'o': 'щ', 'p': 'з', '[': 'х', ']': 'ъ',
        'a': 'ф', 's': 'ы', 'd': 'в', 'f': 'а', 'g': 'п', 'h': 'р', 'j': 'о', 'k': 'л', 'l': 'д', ';': 'ж', "'": 'э',
        'z': 'я', 'x': 'ч', 'c': 'с', 'v': 'м', 'b': 'и', 'n': 'т', 'm': 'ь', ',': 'б', '.': 'ю', '/': '.',
        'Q': 'Й', 'W': 'Ц', 'E': 'У', 'R': 'К', 'T': 'Е', 'Y': 'Н', 'U': 'Г', 'I': 'Ш', 'O': 'Щ', 'P': 'З', '{': 'Х', '}': 'Ъ',
        'A': 'Ф', 'S': 'Ы', 'D': 'В', 'F': 'А', 'G': 'П', 'H': 'Р', 'J': 'О', 'K': 'Л', 'L': 'Д', ':' : 'Ж', '"': 'Э',
        'Z': 'Я', 'X': 'Ч', 'C': 'С', 'V': 'М', 'B': 'И', 'N': 'Т', 'M': 'Ь', '<': 'Б', '>': 'Ю', '?': ',',
        '@': '"', '#': '№', '$': ';', '^': ':', '&': '?'
    }
    other_symbs = ['[', ']', ';', "'", '.', '/', '{', '}', ':', '"', '>', '<', '?', '@', '#', '$', '^', '&']
    other_symbs_dict = {
        '[': 'х', ']': 'ъ',
        ';': 'ж', "'": 'э',
        '.': 'ю', '/': '.',
        '{': 'Х', '}': 'Ъ',
        ':': 'Ж', '"': 'Э',
        '<': 'Б', '>': 'Ю', '?': ',',
        '@': '"', '#': '№', '$': ';', '^': ':', '&': '?'
    }

    #строка, в которую добавятся переведенные на русскую раскладку символы
    final_text = ''

    #цикл, проходящий по каждому символу из текста
    for char in text:
        #проверка на то, является ли символ буквой
        if char.isalpha():
            #проверка на то, является ли символ символом кодировки ascii и является ли он буквой английского алфавита
            if char.isascii() and ('a' <= char <= 'z' or 'A' <= char <= 'Z'):
                #добавление в итоговой текст буквы русского алфавита, найденной по ключу - англйиской букве в словаре
                final_text += translit_dict.get(char)
            else:
                #если символ не является буквой английского алфавита, добавляем его в итоговый текст для вычисления позиции символа в отправленном пользователе тексте
                final_text += char
                return str(len(final_text))
        #в случае, если символ не является буквой, но является одной из альтернатив клавиш с цифрами, выполняются следующие действие, позволяющие отследить, если в тексте пользователя присутствуют символы, которые на англйиской и русской раскладке выглядят по-разному
        elif char in other_symbs:
            final_text += other_symbs_dict.get(char)
        #если символ не является буквой или спец. символом, добавляем символ к итоговому тексту
        else:
            final_text += char

    return final_text

#Функция, осуществляющая переход от русской раскладки к англйиской
def to_eng(text):
    #словарь с английскими буквами, соответствующими русским буквам
    rus_to_eng_dict = {
        'й': 'q', 'ц': 'w', 'у': 'e', 'к': 'r', 'е': 't', 'н': 'y', 'г': 'u', 'ш': 'i', 'щ': 'o', 'з': 'p', 'х': '[', 'ъ': ']',
        'ф': 'a', 'ы': 's', 'в': 'd', 'а': 'f', 'п': 'g', 'р': 'h', 'о': 'j', 'л': 'k', 'д': 'l', 'ж': ';', 'э': "'",
        'я': 'z', 'ч': 'x', 'с': 'c', 'м': 'v', 'и': 'b', 'т': 'n', 'ь': 'm', 'б': ',', 'ю': '.',
        'Й': 'Q', 'Ц': 'W', 'У': 'E', 'К': 'R', 'Е': 'T', 'Н': 'Y', 'Г': 'U', 'Ш': 'I', 'Щ': 'O', 'З': 'P', 'Х': '{', 'Ъ': '}',
        'Ф': 'A', 'Ы': 'S', 'В': 'D', 'А': 'F', 'П': 'G', 'Р': 'H', 'О': 'J', 'Л': 'K', 'Д': 'L', 'Ж': ':', 'Э': '"',
        'Я': 'Z', 'Ч': 'X', 'С': 'C', 'М': 'V', 'И': 'B', 'Т': 'N', 'Ь': 'M', 'Б': '<', 'Ю': '>',
        '"': '@', '№': '#', ';': '$', ':': '^', '?': '&'
    }
    #список спец. символов, которые на англйиской раскладке выглядят иначе
    other_symbs = ['"', '№', ';', ':', '?']
    #словарь спец.символов
    other_symbs_dict = {
        '"': '@', '№': '#', ';': '$', ':': '^', '?': '&'
    }

    final_text = ''

    #аналогичный цикл, как в функции перехода от английской раскладки к русской
    for char in text:
        if char.isalpha():
            if 'а' <= char <= 'я' or 'А' <= char <= 'Я':
                final_text += rus_to_eng_dict.get(char)
            else:
                final_text += rus_to_eng_dict.get(char)
                return str(len(final_text))
        elif char in other_symbs:
            final_text += other_symbs_dict.get(char)
        else:
            final_text += char

    return final_text

#словарь, в который мы пробросим значения, для отлавливания нажатой пользоватлем кнопки, чтобы знать, как именно обрабатывать текст
current_action = {}

#хэндлер, отлавливающий нажатие первой кнопки
@dp.message(F.text == '✅Перевести с русской раскладки на англйискую✅')
async def button1(message: types.Message):
    #пробрасывание в словарь нужного значения
    current_action[message.chat.id] = "to_eng"
    await message.answer('Отлично! Теперь введите текст для обработки',
                         reply_markup=ReplyKeyboardRemove())#удаление клавиатуры, чтобы пользователю было удобнее вводить текст

#хэндлер, отлавливающий нажатие второй кнопки
@dp.message(F.text == '✅Перевести с английской раскладки на русскую✅')
async def button2(message: types.Message):
    current_action[message.chat.id] = "to_ru"
    await message.answer('Отлично! Теперь введите текст для обработки',
                         reply_markup=ReplyKeyboardRemove())

#хэндлер, отлавливающий нажатие третьей кнопки
@dp.message(F.text == '✅Перевести текст в нижний регистр✅')
async def button3(message: types.Message):
    current_action[message.chat.id] = "to_lower"
    await message.answer('Отлично! Теперь введите текст для обработки',
                         reply_markup=ReplyKeyboardRemove())

#хэндлер, отлавливающий приходящее сообщение(любое)
@dp.message()
async def text_handler(message: types.Message):
    #проверка на то, что сообщение пользователя - именно текст
    if message.content_type == 'text':
        text = message.text
        user_reply = f"{message.from_user.username}: {text}\n" #формируем строку для записи в файл
        save_user_reply(user_reply)
        action = current_action.get(message.chat.id)
        #проверка на нажатие пользователем кнопки
        if action:

            #проверка на то, какое именно действие выбрал пользователь
            if action == "to_eng":
                final_text = to_eng(text)
                #проверка на то, что длина отправленного в функцию to_eng текста соответствует длине итогового текста
                if len(final_text) < len(text): #если длина итогового текста оказалась меньше, значит в нем встретились символы английского алфавита
                    await message.answer(f"Во введенном тексте присутствуют символы, не принадлежащие русскому алфавиту. Этот символ №{final_text}", reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))
                else:
                    await message.answer(f"Вот обработанный текст: {final_text}", reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))
            #аналогичные вышеописанным действия
            elif action == "to_ru":
                final_text = to_ru(text)
                if len(final_text) < len(text):
                    await message.answer(f"Во введенном тексте присутствуют символы, не принадлежащие английскому алфавиту. Этот символ №{final_text}", reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))
                else:
                    await message.answer(f"Вот обработанный текст: {final_text}", reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))
            # аналогичные вышеописанным действия
            elif action == "to_lower":
                await message.answer(text.lower(), reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))

        else:
            await message.answer('Пожалуйста, выберите кнопку для ввода текста', reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))
    #в случае, если пользователь отправил не текст, а стикер, фото или голосовое сообщение, например, появится сообщение с просьбой отправить именно текст
    else:
        await message.answer('Пожалуйста, отправьте текст', reply_markup=start_kb.as_markup(
                                 resize_keyboard=True,
                                 input_field_placeholder='Что вас интересует?'
                             ))

#функция main
async def main():
    #установка меню с имеющимися командами у бота
    await bot.set_my_commands(commands=[BotCommand(command = 'start', description='Начать работу.')], scope=BotCommandScopeAllPrivateChats())
    await dp.start_polling(bot, allowed_updates=ALLOWED_UPDATES)

#запуск работы бота
asyncio.run(main())